package day03;

public class Ex13_과제 {

	public static void main(String[] args) {
		/* 1번. 100이하의 소수를 출력하는 코드를 작성하세요.
	       * 2 3 5 7 11 13 ... 97
	       * - 힌트 : 2중 반복문. 소수 판별예제 참고
	       * 
	       * 2번. 다음과 같이 출력되도록 코드를 작성하세요.
	       * 2-1.
	       * *
	       * **
	       * ***
	       * ****
	       * *****
	       * 2-2. 
	       *     *
	       *    **
	       *   ***
	       *  ****
	       * *****
	       * 2-3.
	       *     *
	       *    ***
	       *   *****
	       *  *******
	       * *********
	       * 
	       * 3번. 두 정수가 서로소 관계인지 판별하는 코드를 작성하세요.
	       * 서로소는 두 정수의 최대 공약수가 1인 두 수의 관계
	       * 예시
	       * 정수 입력 : 10
	       * 정수 입력 : 7
	       * 10과 7은 서로소입니다.
	       * 예시
	       * 정수 입력 : 10
	       * 정수 입력 : 8
	       * 10과 8은 서로소가 아닙니다.
	       * - 힌트 : 최대 공약수 예제 참고
	       * 
	       * 4번. 아래와 같이 출력되도록 코드를 작성하세요.
	       * 1 2 3 4
	       * 8 7 6 5
	       * 9 10 11 12
	       * 16 15 14 13
	       * */ 

	}

}
